{"content":"Michael A. Jordan\n16 Old Colony Road, Hingham, Massachusetts 02043-1063; (781) 749-0075; michael@majordan.net; majordan.net\n\nCareer Overview:\nA Web Developer\/Programmer with nine years’ interactive experience. Core capabilities\ninclude: accessible Flash and Flex development in ActionScript, standard-based Web\nprogramming in HTML\/XHTML, CSS, and JavaScript, database-driven site development and\ncontent-management system programming with PHP and MySQL, Miva Merchant e-commerce\nplatform configuration and interface development, writing user-interface style guide\ndocumentation.\n\nTechnical Skills:\nOperating Systems:\nLanguages and\nFrameworks:\nSoftware Programs:\n\nWindows 98\/2000\/XP\/Vista, MacOS X, MacOS 9, Unix\/Linux (for web servers)\nFlash ActionScript 1.0, 2.0 and 3.0, HTML\/XHTML, CSS, JavaScript, XPath, PHP, MySQL,\nPapervision3D, Flex Framework, Text Layout Framework, jQuery\nAdobe Flash, Flex Builder, Dreamweaver, Photoshop, Illustrator, Fireworks, Eclipse,\nFlashDevelop, Captionate, JAWS for Windows, Window-Eyes, BBEdit, Lotus Notes, Microsoft\nWord, Excel, PowerPoint, Outlook, and Visio.\n\nInteractive Experience:\n2007-Present\n\nFLASH ACCESSIBILITY CONSULTANT\nFreelance\nCompleted numerous coding, documentation and tutorial projects for Adobe involving Flash\nand Flex accessibility.\nSignificant projects include:\n a collection of FLVPlayback component skins with built-in support for captioning and\naccompanying devnet tutorial,\n adding keyboard accessibility, screen-reader support, caption transcripts, and caption\nsearch to the AS3 FLVPlayback and FLVPlaybackCaptioning components in Flash CS4,\n an Accessible Video Demonstration which was used as part of the WCAG 2.0\nImplementation Report,\n writing the documentation for and delivering an Adobe MAX presentation on the\nflash.accessibility.AccessibilityImplementation class for Flex,\n a display settings component for Flash CS3,\n and an implementation of DFXP Timed Text in Flash.\n\nMarch 2006 Present\n\nINTERACTIVE TECHNOLOGY LEAD\nModernista!\nBoston, Massachusetts\nDeveloped, programmed, and helped manage a team of developers to produce and maintain\ninteractive work for clients including Palm, Cadillac, Hummer, Hearts on Fire, Stop Handgun\nViolence, TIAA-CREF, and (PRODUCT) RED.\nSignificant projects I worked on include the 2010 Cadillac SRX micro site, the Hearts On Fire\nArchitectural Collection micro site and HeartsOnFire.com, the Palm Prē advertising landing\npage, the (RED)NIGHTS micro site, and Modernista.com.\nDeveloped and programmed a framework in ActionScript 2.0 to support localized international\nversions of Hummer.com. Managed a team of developers to build out content sections based\non the framework. Developed dynamic user interfaces in Flash that scaled to accommodate\nlocalized text in twenty-seven languages. Oversaw the delivery of the content files in XML to\nthe translators, and the deployment of translated content files on the site. Programmed vehicle\nconfiguration tool with support for multiple languages and localized pricing.\n\n2003 - 2006\n\nSENIOR WEB DEVELOPER\nHoughton Mifflin Company\nBoston, Massachusetts\nDeveloped and programmed interactive games, product demonstrations, and Web sites in\nFlash and XHTML for the School Division’s Instructional Technology department.\nWorked with a team of interactive content producers to develop fun and educational games for\nthe School Division’s Eduplace.com Web site. Programmed game engines that are capable of\nbeing repurposed throughout the site with different user interfaces and content.\nSignificant projects I developed include Word Builder, Word Sort, Crossword Challenge, Web\n\n\fWord Find, eWord Game, eGlossary, and Discover! Simulations.\nSeveral of these games are featured at Adobe.com’s Accessibility Resource Center as examples\nof accessible Flash.\nPresented on accessible Flash development at the 2005 South by Southwest Interactive\nFestival and at the CSUN 20th Annual International Conference \"Technology and Persons with\nDisabilities.\nProgrammed and helped design product demonstrations in Flash of Houghton Mifflin’s\nTechnology products and Houghton Mifflin’s Reading program for distribution on CD-ROM and\nvia the Web. Made extensive use of object-oriented programming methods in Flash to provide\nmaximum flexibility during the design cycle and to allow other team members to populate\nslideshow templates with content without having to edit code.\nAdvised on best practices for accessible Web page development using XHTML, JavaScript and\nCSS.\n2000 - 2002\n\nDEVELOPER\/PROGRAMMER\nRed98 LLC\nBoston, Massachusetts\nDeveloped and programmed dynamic Web sites at an interactive agency specializing in usercentered design, communications, tools, and applications.\nWorked with a team of interface designers, information architects, and copywriters to develop\ncompelling Web-strategies for our clients in diverse industries. Consulted on technical aspects\nof the sites’ design and interaction. Advised on Web-standards and accessibility.\nHand-coded cross-browser compatible Web sites in HTML\/XHTML, CSS, JavaScript, and PHP.\nProgrammed Flash interfaces with Flash ActionScript. Developed content-management tools\nand database-driven websites with PHPand MySQL. Configured and developed interface for an\ne-commerce site using Miva Merchant.\nWrote user-interface style guide for an Intranet-based client-servicing system developed in\npartnership with Microsoft for FM Global, a leading commercial and industrial property\ninsurance company.\nClients include: Batesville Casket Company, Boeri Sport USA, Cafco, CitiStreet, Doug Flutie Jr.\nFoundation, Fidelity Investments, FM Global, HomeRuns, Eli Lilly, Insurance.com, Microsoft,\nMorningside, Salamander Restaurant, Sprint PCS, Toyota.\n\nBusiness Experience:\n1993 - 2000\n\nPRODUCTION MANAGER\nMedia Distribution Services - New England\nWeymouth, Massachusetts\nManaged day-to-day production for a company specialized in providing mail, fax, wire service\nand e-mail distribution of news releases, press kits, and product samples for public relations\nand corporate communications clients.\nAssessed client needs and programmed searches to generate mailing and fax lists from a\ndatabase of more than 200,000 media contacts. Designed databases and managed data for\npublic relations and investor relations clients. Set up and managed fax broadcasts through a\nfax broadcast server. Set up and managed e-mail and wire service broadcasts. Operated\nmailing inserter and supervised address verification and mail presorting for bulk and\nautomated rate discounts. Coordinated printing and assembly of press kits and other\nspecialized mailings.\nProgrammed and managed database software to automate fax report generation for clients\nand billing, significantly improving productivity.\nManaged the transfer of the fax broadcasting service to a new, enhanced platform.\n\n1992 - 1993\n\nPRODUCTION ASSISTANT\nDartmouth Publishing Inc.\nWatertown, Massachusetts\nParticipated in the design of collateral materials, textbook artwork, posters, and flyers at a\npre-press design firm.\nAdministered Collegiate Resume Printing Service through Harvard Business School and Barnes\n& Noble Bookstores on 31 College Campuses.\n\nSummer - Fall 1992\n\nINTERN\nSchneider & Associates Public Relations\nBoston, Massachusetts\nParticipated in media relations for AirFair ’92, New England’s largest air show.\nExperienced writing press releases calendar announcements, developing media lists, and\n\n\fpitching stories to the press.\n1991 - 1992\n\nSALES ASSOCIATE\nBOSE Corporation\nWaltham, Massachusetts\nCompleted extensive sales training program and effectively demonstrated and sold high-tech\naudio products in the field.\n\nAwards:\n2002 Finalist\/Best Technology Services Web Site from MIMC (Massachusetts Interactive Media\nCouncil) for Red98.com.\n2002 Standard of Excellence from the Web Marketing Association (WMA) for Red98.com.\n2001 Finalist\/Best Apparel Web Site from MIMC for BoeriUSA.com.\n2001 Outstanding Web Site from WMA for BoeriUSA.com.\n\nEducation:\nHaverford College B.A. 1991 in English\n\nPersonal:\nWas active in the Boston music scene for over a decade as a guitarist and performer. My\nband, The Gravy, released two albums and an EP on Q Division Records and received favorable\nreviews in Rolling Stone and Musician Magazine.\n\nReferences:\nAvailable upon request.","annotation":[{"label":["Name"],"points":[{"start":"0","end":"7","text":"Michael"}]},{"label":["Name"],"points":[{"start":"18","end":"44","text":"16 Old Colony Road, Hingha"}]},{"label":["College Name"],"points":[{"start":"111","end":"119","text":"majordan"}]}]}